In [3]:
import pandas as pd
df = pd.read_csv('Titanic-Dataset.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
print("Number of Unique Values in The Column 'Sex':")
print(df['Sex'].nunique())

Number of Unique Values in The Column 'Sex':
2

In [5]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

# Embarked

In [7]:
df['Embarked'].nunique()

3

In [8]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [12]:
test_dataframe = df[['Embarked']]

In [13]:
test_dataframe

    Embarked
0          S
1          C
2          S
3          S
4          S
..       ...
886        S
887        S
888        S
889        C
890        Q

[891 rows x 1 columns]

## OrdinalEncoding

In [14]:
from sklearn.preprocessing import OrdinalEncoder

enc = OrdinalEncoder()

enc.fit(test_dataframe)

OrdinalEncoder()

In [15]:
enc.categories_

[array(['C', 'Q', 'S', nan], dtype=object)]

In [16]:
test_dataframe_enc = enc.transform(test_dataframe)

In [18]:
test_dataframe_enc[:5]

array([[2.],
       [0.],
       [2.],
       [2.],
       [2.]])

## One-hot Encoding

In [19]:
enc_pc_df = pd.get_dummies(test_dataframe, columns = ['Embarked'])
print(enc_pc_df.head())

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [20]:
enc_pc_df = pd.get_dummies(test_dataframe, columns = ['Embarked'],
                          drop_first=True)
print(enc_pc_df.head())

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1